# Pandas Tutorial

Pandas is a Python library providing high-performance, easy-to-use data structures and data analysis tools

Pandas deals with the following three data structures:

    Series
    DataFrame
    Panel (ignore this one for now)

### Importing the modules

In [ ]:
#!pip install pandas

In [1]:
import pandas as pd
import numpy as np

## Pandas.series
Series is a one-dimensional labeled array capable of holding data of one type.

pandas.Series(data, index, dtype, copy)

### Create empty series

In [2]:
s = pd.Series()
print(s)

Series([], dtype: float64)

### Create series from ndarray

In [3]:
data = np.array(['a','b','c','d']) 
s = pd.Series(data) #default indexing was used

print(data)
print('\n')
print(s)

['a' 'b' 'c' 'd']


0    a
1    b
2    c
3    d
dtype: object

In [4]:
s

0    a
1    b
2    c
3    d
dtype: object

In [7]:
print(s.index)
print(s.index.tolist())

RangeIndex(start=0, stop=4, step=1)
[0, 1, 2, 3]

In [8]:
s = pd.Series(data,index=['100','101','102','103'])

print(data)
print('\n')
print(s)

['a' 'b' 'c' 'd']


100    a
101    b
102    c
103    d
dtype: object

In [9]:
s.index.tolist()

['100', '101', '102', '103']

### Create series from scalar

In [10]:
s = pd.Series(5, index=[0, 1, 2, 3, 4, 5, 23])
print(s)

0     5
1     5
2     5
3     5
4     5
5     5
23    5
dtype: int64

### Create series from dictionary

In [11]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)

print(data)
print('\n')
print(s)

{'a': 0.0, 'b': 1.0, 'c': 2.0}


a    0.0
b    1.0
c    2.0
dtype: float64

In [12]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data, index = ['a',1,2])

print(data)
print('\n')
print(s)

{'a': 0.0, 'b': 1.0, 'c': 2.0}


a    0.0
1    NaN
2    NaN
dtype: float64

In [13]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)
s.index = [0,1,2]
print(data)
print('\n')
print(s)

{'a': 0.0, 'b': 1.0, 'c': 2.0}


0    0.0
1    1.0
2    2.0
dtype: float64

In [14]:
s.index

Int64Index([0, 1, 2], dtype='int64')

### Accessing elements with index

In [15]:
s = pd.Series([1,2,3,4,5],index = ('a','f','b','q','c'))

print(s)
print('\n')

print('Forth element')
print(s[3])
print('\n')

print('Elements 3-5')
print(s[2:4])
print('\n')

print('The last 3 elements')
print(s[-3:])
print('\n')

print('Letter indexing')
print(s['a':'b'])

a    1
f    2
b    3
q    4
c    5
dtype: int64


Forth element
4


Elements 3-5
b    3
q    4
dtype: int64


The last 3 elements
b    3
q    4
c    5
dtype: int64


Letter indexing
a    1
f    2
b    3
dtype: int64

In [16]:
s = pd.Series([1,2,3,4,5],index = (0, 2, 3, 4, 7))

print(s)
print('\n')

print('Forth element')
print(s[2:4])
print('\n')

0    1
2    2
3    3
4    4
7    5
dtype: int64


Forth element
3    3
4    4
dtype: int64

## Pandas.DataFrame
Two-dimensional data structure, columns can be of different data types (and usually are :))

pandas.DataFrame(data, index, columns, dtype)

### Create an empty dataframe

In [17]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

### Create dataframe from list

In [18]:
data = [1,2,3,4,5]
#df = pd.DataFrame(data)
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [19]:
data = [1,2,3,4,5]
#df = pd.DataFrame(data)
df = pd.DataFrame(data, columns = ['first'])
print(df)

   first
0      1
1      2
2      3
3      4
4      5

In [20]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
print(df)
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

### Create dataframe from a dictionary

In [21]:
data = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}
df1 = pd.DataFrame.from_dict(data)
df1

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [ ]:
?pd.DataFrame.from_dict

In [22]:
data = {'row_1': [3, 2, 1, 0], 'row_2': ['a', 'b', 'c', 'd']}
df1 = pd.DataFrame.from_dict(data, orient='index', 
                             columns=['c1', 'c2', 'c3', 'c4'])
df1

      c1 c2 c3 c4
row_1  3  2  1  0
row_2  a  b  c  d

In [23]:
df1.dtypes

c1    object
c2    object
c3    object
c4    object
dtype: object

In [24]:
data = {'row_1': [3, 2, 1, 0], 'row_2': ['a', 'b', 'c']}
df1 = pd.DataFrame.from_dict(data, orient='index', 
                             columns=['c1', 'c2', 'c3', 'c4'])
df1

      c1 c2 c3   c4
row_1  3  2  1  0.0
row_2  a  b  c  NaN

### Give column names

In [25]:
df1

      c1 c2 c3   c4
row_1  3  2  1  0.0
row_2  a  b  c  NaN

In [26]:
df1.columns

Index(['c1', 'c2', 'c3', 'c4'], dtype='object')

In [27]:
df1.columns.tolist()

['c1', 'c2', 'c3', 'c4']

In [28]:
df1.columns = ['A', 'B', 'C', 'D']
df1

       A  B  C    D
row_1  3  2  1  0.0
row_2  a  b  c  NaN

### Create dataframe from a list of dictionaries

In [29]:
?pd.DataFrame

In [30]:
data = [{'a': 1, 'b': 2, 'd': 0},{'a': 5, 'b': 10, 'c': 20}]
df1 = pd.DataFrame(data, index=['first', 'second']) 

print (df1)

        a   b    d     c
first   1   2  0.0   NaN
second  5  10  NaN  20.0

In [31]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b']) 

print (df1)

        a   b
first   1   2
second  5  10

In [ ]:
#try to add 'c' to the list of columns
data = [{'a': 1, 'b': 2, 'd': 0},{'a': 5, 'b': 10, 'c': 20}]
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b', 'c', 'd']) 

print (df1)

### Selecting columns

In [32]:
data = [['Alex',10, 2009],['Bob',12, 2011],['Clarke',13, 2012]]
df = pd.DataFrame(data,columns=['Name','Age', 'Year'])

print(df)
print('\n')
print(df['Age'])
print(type(df['Age']))

     Name  Age  Year
0    Alex   10  2009
1     Bob   12  2011
2  Clarke   13  2012


0    10
1    12
2    13
Name: Age, dtype: int64
<class 'pandas.core.series.Series'>

In [33]:
print(df)
print(df[['Age']])
print(df[['Age', 'Name']])

     Name  Age  Year
0    Alex   10  2009
1     Bob   12  2011
2  Clarke   13  2012
   Age
0   10
1   12
2   13
   Age    Name
0   10    Alex
1   12     Bob
2   13  Clarke

In [34]:
print(df[['Weight', 'Name']])

KeyError: "['Weight'] not in index"

### Selecting rows and columns

In [ ]:
df

In [35]:
df['Name']

0      Alex
1       Bob
2    Clarke
Name: Name, dtype: object

In [36]:
df['Name'][1]

'Bob'

### .loc, .iloc(use integer indexing) and .ix(the mix of 2, deprecated)

In [ ]:
np.random.randn(8, 4)

In [ ]:
?np.random.randn

In [37]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

#select all rows for specific columns
print(df)
print('\n')
print(df.loc[:,['A','B']])
print('\n')

          A         B         C         D
a -2.015411 -1.850624  0.184108  0.377336
b -0.009982 -0.393333 -1.524089 -1.570806
c  0.787817  2.043496 -0.089150  1.653799
d -0.204899 -0.043183 -1.189380 -0.165423
e  0.945343  1.398653 -0.159481 -0.010544
f  0.778112 -0.538683  0.822032  0.695745
g  1.441685  1.457454 -0.368884  0.614496
h -0.840616 -0.344378 -1.383351  0.517912


          A         B
a -2.015411 -1.850624
b -0.009982 -0.393333
c  0.787817  2.043496
d -0.204899 -0.043183
e  0.945343  1.398653
f  0.778112 -0.538683
g  1.441685  1.457454
h -0.840616 -0.344378

In [38]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])


#select some rows for specific columns
print(df)
print('\n')
print(df.loc[['a','b'],['A','B']])
print('\n')

          A         B         C         D
a -1.668352  0.373608  0.069201 -0.797397
b  1.131367 -0.794007 -0.103603  0.142224
c -0.421066  0.710990  0.771963 -0.830657
d -0.388713 -1.944150  0.633191  0.688885
e  1.705515  0.155058 -0.812986  0.194984
f  0.212735  1.294173  0.863771 -0.730756
g -0.905676  0.231785  2.010376 -1.489078
h  0.577668 -0.250831 -0.033500 -1.799407


          A         B
a -1.668352  0.373608
b  1.131367 -0.794007

In [39]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])


print(df)
print('\n')
print(df.loc['a']>0)
print('\n')

          A         B         C         D
a -0.896289  0.904856  0.572740 -0.643414
b -0.040353  0.276113 -0.755402 -0.316390
c -0.773707 -0.334707  0.296310  2.052849
d -1.196756 -0.323391  1.318905 -0.386085
e  0.364852 -0.186566  0.452066  1.070598
f -0.602829 -0.704786  1.566063  1.436056
g -1.241950  0.910092  0.053215 -0.769457
h -0.918322  0.544439  0.028472 -2.121552


A    False
B     True
C     True
D    False
Name: a, dtype: bool

In [40]:
df.loc['a','B'] = 10000
df

          A             B         C         D
a -0.896289  10000.000000  0.572740 -0.643414
b -0.040353      0.276113 -0.755402 -0.316390
c -0.773707     -0.334707  0.296310  2.052849
d -1.196756     -0.323391  1.318905 -0.386085
e  0.364852     -0.186566  0.452066  1.070598
f -0.602829     -0.704786  1.566063  1.436056
g -1.241950      0.910092  0.053215 -0.769457
h -0.918322      0.544439  0.028472 -2.121552

In [41]:
df['A'] = 10000
df

       A             B         C         D
a  10000  10000.000000  0.572740 -0.643414
b  10000      0.276113 -0.755402 -0.316390
c  10000     -0.334707  0.296310  2.052849
d  10000     -0.323391  1.318905 -0.386085
e  10000     -0.186566  0.452066  1.070598
f  10000     -0.704786  1.566063  1.436056
g  10000      0.910092  0.053215 -0.769457
h  10000      0.544439  0.028472 -2.121552

In [42]:
print(df[2:3])
df[3:5]

       A         B        C         D
c  10000 -0.334707  0.29631  2.052849

       A         B         C         D
d  10000 -0.323391  1.318905 -0.386085
e  10000 -0.186566  0.452066  1.070598

In [43]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])

print(df)
print('\n')
print(df.iloc[[0,1,3],[0,1]])
print('\n')

          A         B         C         D
a  1.781405 -0.895726  2.638583  1.121734
b  1.311516  0.458350  0.075291 -0.122371
c -0.124324  0.307287 -1.305907  1.039723
d  1.266074 -1.142972  2.002336  1.204625
e -1.665064  1.912798  1.298779 -2.728144
f  0.407728  0.795802 -0.550336 -1.038299
g  0.283322  1.046371  1.171837  1.184902
h  0.012533 -0.331030  0.432772  0.505988


          A         B
a  1.781405 -0.895726
b  1.311516  0.458350
d  1.266074 -1.142972

In [44]:
df = pd.DataFrame(np.random.randn(8, 4),
index = ['a','b','c','d','e','f','g','h'], columns = ['A', 'B', 'C', 'D'])


print(df)
print('\n')
print(df.iloc[0:3,[0,1]])
print('\n')

          A         B         C         D
a  0.888133 -0.606384  1.904625  0.105976
b  0.001299  0.549271 -0.785214 -0.882435
c -2.454482 -0.398411  1.345104  1.271758
d  0.040760  0.097110  0.313746  2.012257
e -1.322439 -0.510162 -1.625824  0.744521
f -2.576281 -0.165530  1.282322 -1.147761
g  0.502273  0.787732  0.219470 -1.891940
h -0.616229 -0.152115 -1.439809 -0.420185


          A         B
a  0.888133 -0.606384
b  0.001299  0.549271
c -2.454482 -0.398411

### Filtering by a column condition

In [45]:
data = [['Alex',10, 2009],['Bob',12, 2011],['Clarke',13, 2012]]
df = pd.DataFrame(data,columns=['Name','Age', 'Year'])
df

     Name  Age  Year
0    Alex   10  2009
1     Bob   12  2011
2  Clarke   13  2012

In [46]:
print(df)
df1 = df[df['Age']==10]
df1

     Name  Age  Year
0    Alex   10  2009
1     Bob   12  2011
2  Clarke   13  2012

   Name  Age  Year
0  Alex   10  2009

In [47]:
print(df)
df[(df['Age']>10) & (df['Year']>2000)]

     Name  Age  Year
0    Alex   10  2009
1     Bob   12  2011
2  Clarke   13  2012

     Name  Age  Year
1     Bob   12  2011
2  Clarke   13  2012

### Adding a column

In [48]:
data = [['Alex',10, 2009],['Bob',12, 2011],['Clarke',13, 2012]]
df = pd.DataFrame(data,columns=['Name','Age', 'Year'])


df

     Name  Age  Year
0    Alex   10  2009
1     Bob   12  2011
2  Clarke   13  2012

In [49]:
len(df)

3

In [50]:
#df['Gender']=pd.Series(['male','male','male'])
#df['Gender'] = 'male'
df['Gender'] = ['male','male','male']
print(df)

     Name  Age  Year Gender
0    Alex   10  2009   male
1     Bob   12  2011   male
2  Clarke   13  2012   male

In [51]:
type(df['Gender'])

pandas.core.series.Series

In [52]:
df['Gender'] = 1
df

     Name  Age  Year  Gender
0    Alex   10  2009       1
1     Bob   12  2011       1
2  Clarke   13  2012       1

### Column deletion

In [53]:
data = [['Alex',10, 2009],['Bob',12, 2011],['Clarke',13, 2012]]
df = pd.DataFrame(data,columns=['Name','Age', 'Year'])


print(df)
print('\n')

del df['Year']
print(df)

     Name  Age  Year
0    Alex   10  2009
1     Bob   12  2011
2  Clarke   13  2012


     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [54]:
data = [['Alex',10, 2009],['Bob',12, 2011],['Clarke',13, 2012]]
df = pd.DataFrame(data,columns=['Name','Age', 'Year'])

print(df)
print('\n')

df.drop('Year', axis=1, inplace=True)

     Name  Age  Year
0    Alex   10  2009
1     Bob   12  2011
2  Clarke   13  2012

In [55]:
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

### Slice rows

In [56]:
data = [['Alex',10],['Bob',12],['Clarke',13],['Jane',16],['Anna',10]]
df = pd.DataFrame(data,columns=['Name','Age'],index=[2,5,1,0,3])

print(df)
print('\n')
print(df[2:4])

     Name  Age
2    Alex   10
5     Bob   12
1  Clarke   13
0    Jane   16
3    Anna   10


     Name  Age
1  Clarke   13
0    Jane   16

## Some series and dataframe functions

In [57]:
np.random.randn(4)

array([-0.01534601, -1.32060747,  0.46347121, -0.35881517])

In [58]:
s = pd.Series(np.random.randn(4))
print(s)
print('\n')
print ("The axes are:")
print(s.axes)
print(list(s.axes[0]))
print(s.index)
print(list(s.index))

0    1.538902
1    1.349137
2    0.663777
3    0.957478
dtype: float64


The axes are:
[RangeIndex(start=0, stop=4, step=1)]
[0, 1, 2, 3]
RangeIndex(start=0, stop=4, step=1)
[0, 1, 2, 3]

In [59]:
s = pd.Series(np.random.randn(4))
print(s)
print('\n')
print ("The data type is:")
print(s.dtype)

0   -1.226421
1   -0.026505
2   -0.390839
3    0.538612
dtype: float64


The data type is:
float64

In [60]:
data = [['Alex',10],['Bob',12],['Clarke',13],['Jane',16],['Anna',10]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13
3    Jane   16
4    Anna   10

In [61]:
print(df.dtypes)

Name    object
Age      int64
dtype: object

In [62]:
print(s)
print('\n')
print ("Is the Object empty?")
print(s.empty)

0   -1.226421
1   -0.026505
2   -0.390839
3    0.538612
dtype: float64


Is the Object empty?
False

In [63]:
print(s)
print('\n')
print ("The dimensions of the object:")
print(s.ndim)

0   -1.226421
1   -0.026505
2   -0.390839
3    0.538612
dtype: float64


The dimensions of the object:
1

In [64]:
data = [['Alex',10],['Bob',12],['Clarke',13],['Jane',16],['Anna',10]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13
3    Jane   16
4    Anna   10

In [65]:
print(df.ndim)

2

In [66]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
print ("Our object is:")
print(df)
print('\n')

print ("The shape of the object is:")
print(df.shape)

Our object is:
     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13


The shape of the object is:
(3, 2)

In [67]:
print ("Our object is:")
print(df)

print('\n')
print('The first 2 rows of the dataframe:')
print(df.head(2))

print('\n')
print('The last 2 rows of the dataframe:')
print(df.tail(2))

Our object is:
     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13


The first 2 rows of the dataframe:
   Name  Age
0  Alex   10
1   Bob   12


The last 2 rows of the dataframe:
     Name  Age
1     Bob   12
2  Clarke   13

In [ ]:
#df[:10] = df.head(10)

In [68]:
?df.head

### Count the number of values in a column

In [69]:
data = [['Alex',10],['Bob',12],['Clarke',13],['Clarke',18]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13
3  Clarke   18

In [70]:
x = df['Name'].value_counts()
print(type(x))
print(x)

<class 'pandas.core.series.Series'>
Clarke    2
Bob       1
Alex      1
Name: Name, dtype: int64

# Missing values

In [71]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

print (df)

        one       two     three
a -0.674752 -0.193157  0.955080
b       NaN       NaN       NaN
c  1.247430  1.842960 -1.373894
d       NaN       NaN       NaN
e  0.448822  0.655654  0.053931
f -0.534369  0.533124 -0.132079
g       NaN       NaN       NaN
h -1.019633 -0.447010  0.075198

In [72]:
df['one'].isnull()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [73]:
df['one'].isna()

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [74]:
df['one'].isna().sum()

3

In [75]:
df['one'].notnull()

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [76]:
len(df[df['one'].isna()])

3

# Replacing the missing data

In [77]:
df

        one       two     three
a -0.674752 -0.193157  0.955080
b       NaN       NaN       NaN
c  1.247430  1.842960 -1.373894
d       NaN       NaN       NaN
e  0.448822  0.655654  0.053931
f -0.534369  0.533124 -0.132079
g       NaN       NaN       NaN
h -1.019633 -0.447010  0.075198

In [78]:
df1 = df.fillna(method = 'bfill')
df1

        one       two     three
a -0.674752 -0.193157  0.955080
b  1.247430  1.842960 -1.373894
c  1.247430  1.842960 -1.373894
d  0.448822  0.655654  0.053931
e  0.448822  0.655654  0.053931
f -0.534369  0.533124 -0.132079
g -1.019633 -0.447010  0.075198
h -1.019633 -0.447010  0.075198

### See some other options that fillna() provides in the python documentation :)

In [79]:
?df.fillna

In [80]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f','h'],columns=['one', 'two', 'three'])

df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

print (df)

        one       two     three
a  0.093013 -0.319793 -1.856088
b       NaN       NaN       NaN
c -0.735008  0.940399  0.539355
d       NaN       NaN       NaN
e  1.089900  0.464933 -0.788778
f  0.163660  0.321167  0.872116
g       NaN       NaN       NaN
h -0.329167 -0.276556  0.082354

In [81]:
df.fillna(np.mean(df))

        one       two     three
a  0.093013 -0.319793 -1.856088
b  0.056480  0.226030 -0.230208
c -0.735008  0.940399  0.539355
d  0.056480  0.226030 -0.230208
e  1.089900  0.464933 -0.788778
f  0.163660  0.321167  0.872116
g  0.056480  0.226030 -0.230208
h -0.329167 -0.276556  0.082354

In [82]:
np.mean(df)

one      0.056480
two      0.226030
three   -0.230208
dtype: float64

In [83]:
df['one'] = df['one'].fillna(0)

In [84]:
df['one'] = df['one'].fillna(np.mean(df['one']))

In [85]:
df

        one       two     three
a  0.093013 -0.319793 -1.856088
b  0.000000       NaN       NaN
c -0.735008  0.940399  0.539355
d  0.000000       NaN       NaN
e  1.089900  0.464933 -0.788778
f  0.163660  0.321167  0.872116
g  0.000000       NaN       NaN
h -0.329167 -0.276556  0.082354

In [86]:
df.index = np.arange(1, len(df)+1)

In [87]:
df

        one       two     three
1  0.093013 -0.319793 -1.856088
2  0.000000       NaN       NaN
3 -0.735008  0.940399  0.539355
4  0.000000       NaN       NaN
5  1.089900  0.464933 -0.788778
6  0.163660  0.321167  0.872116
7  0.000000       NaN       NaN
8 -0.329167 -0.276556  0.082354

### Dropping the missing data

In [88]:
df2 = df.dropna()
df2

        one       two     three
1  0.093013 -0.319793 -1.856088
3 -0.735008  0.940399  0.539355
5  1.089900  0.464933 -0.788778
6  0.163660  0.321167  0.872116
8 -0.329167 -0.276556  0.082354

In [ ]:
?df.dropna

### Replacing regular values

In [89]:
df = pd.DataFrame({'one':[10,20,30,40,50,2000],'two':[1000,0,30,40,50,60]})

print(df)
print('\n')
df1 = df.replace({1000:10,2000:60})
df1

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60

   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60

# Getting unique values in a column

In [90]:
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',10],['Clarke',18]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   10
3  Clarke   18

In [91]:
df['Name']

0      Alex
1       Bob
2    Clarke
3    Clarke
Name: Name, dtype: object

In [92]:
#unique values
df['Name'].unique()

array(['Alex', 'Bob', 'Clarke'], dtype=object)

In [93]:
#number of unique values
df['Name'].nunique()

3

## Descriptive statistics

In [94]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])}

#Create a DataFrame
df = pd.DataFrame(d)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

## mean()
returns the average value

In [2]:
#help(df.mean()

In [96]:
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [ ]:
df.mean()  #of the numerical columns

In [97]:
df[['Age', 'Rating']].sum()

Age       382.00
Rating     44.92
dtype: float64

## std()
returns standard deviation only for the numerical columns

In [98]:
df.std()

Age       9.232682
Rating    0.661628
dtype: float64

## Summarizing Data
describe() computes the summary of statistics

In [99]:
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [100]:
df.describe()

             Age     Rating
count  12.000000  12.000000
mean   31.833333   3.743333
std     9.232682   0.661628
min    23.000000   2.560000
25%    25.000000   3.230000
50%    29.500000   3.790000
75%    35.500000   4.132500
max    51.000000   4.800000

# Loading data from a file into a dataframe

In [101]:
s = pd.read_csv('Practical_hw/data/gender.txt')
s

FileNotFoundError: [Errno 2] File b'Practical_hw/data/gender.txt' does not exist: b'Practical_hw/data/gender.txt'

In [ ]:
?pd.read_csv

In [ ]:
s = pd.read_csv('Practical_hw/data/gender.txt', sep='|', index_col = 'user_id')
s

In [ ]:
s = pd.read_csv('Practical_hw/data/gender.txt', sep='|')
s

## Renaming rows and columns

In [102]:
print(df1)
print (df1.rename(columns={'one' : '1', 'two' : '2'}, index = {0 : 'apple', 1 : 'banana', 2 : 'durian'}))

   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60
         1   2
apple   10  10
banana  20   0
durian  30  30
3       40  40
4       50  50
5       60  60

In [103]:
df1.columns = ['a','b']
df1

    a   b
0  10  10
1  20   0
2  30  30
3  40  40
4  50  50
5  60  60

## Reindexing

In [104]:
df1 = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])
df_reindexed = df1.reindex(index=[0,2,5,10,8])
#df1.index = [0,2,5,10,8] inplace
print(df1)
print('\n')
print(df_reindexed)

       col1      col2      col3
0 -0.484083 -1.210269  0.991828
1  0.240699  0.404129 -0.433709
2 -0.638767  1.601333  0.849639
3  0.358264  0.710915  0.447404
4 -1.013470 -0.743368  1.118874


        col1      col2      col3
0  -0.484083 -1.210269  0.991828
2  -0.638767  1.601333  0.849639
5        NaN       NaN       NaN
10       NaN       NaN       NaN
8        NaN       NaN       NaN

In [105]:
df1 = pd.DataFrame(np.random.randn(10,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(7,3),columns=['col1','col2','col3'])


print(df1)
print('\n')

print(df2)
print('\n')


#df = df2.reindex_like(df1)
df = df1.reindex_like(df2)
print(df)

       col1      col2      col3
0  1.458452 -0.263327 -0.654982
1 -0.820463 -0.460328 -1.002370
2  1.164439  2.168848 -0.352546
3  0.017406  0.787298  0.152553
4 -0.855145  0.206319  2.914220
5 -0.521300 -0.207308 -0.048430
6 -0.260575  0.007056 -0.016350
7  0.859059  1.208781  0.519050
8  0.023230 -0.914743 -1.075082
9  0.352848  0.167019  1.350482


       col1      col2      col3
0 -0.364128  0.640538  0.388798
1  0.764661  2.004798 -0.578821
2 -1.300390  0.996191  1.271625
3 -0.077824  0.619314 -0.011798
4 -1.755629 -1.563785  0.108795
5  0.972736 -1.682583  0.236553
6 -1.228577 -1.873893 -1.434006


       col1      col2      col3
0  1.458452 -0.263327 -0.654982
1 -0.820463 -0.460328 -1.002370
2  1.164439  2.168848 -0.352546
3  0.017406  0.787298  0.152553
4 -0.855145  0.206319  2.914220
5 -0.521300 -0.207308 -0.048430
6 -0.260575  0.007056 -0.016350

In [106]:
df1 = pd.DataFrame(np.random.randn(10,3),columns=['col1','col2','col3'])
df2 = pd.DataFrame(np.random.randn(7,3),columns=['col2','col3','col4'])


print(df1)
print('\n')

print(df2)
print('\n')

df1.columns = df2.columns
df1

       col1      col2      col3
0  1.625722 -0.976571  0.473643
1 -0.718190 -0.481102 -2.143378
2 -0.572116  0.415894 -1.259313
3 -0.263089  0.267719  0.640519
4  0.102701  2.428979 -0.856680
5  1.577443 -0.059299 -1.441438
6 -2.871671 -0.484573  0.214166
7  0.705895 -0.224860  0.081630
8  1.404520  0.572660 -1.068225
9  0.351451 -0.785182  1.007941


       col2      col3      col4
0 -0.357512 -3.180648 -0.044888
1  1.004734  2.506769 -0.395117
2  1.043915 -0.132346  2.239011
3 -1.418847  1.565467 -0.463147
4  0.685371 -0.741331 -0.138155
5 -0.287106  1.846350  1.544481
6  0.313300  1.092839 -0.107738

       col2      col3      col4
0  1.625722 -0.976571  0.473643
1 -0.718190 -0.481102 -2.143378
2 -0.572116  0.415894 -1.259313
3 -0.263089  0.267719  0.640519
4  0.102701  2.428979 -0.856680
5  1.577443 -0.059299 -1.441438
6 -2.871671 -0.484573  0.214166
7  0.705895 -0.224860  0.081630
8  1.404520  0.572660 -1.068225
9  0.351451 -0.785182  1.007941

## Changing the indexing

In [ ]:
df1 = pd.DataFrame(np.random.randn(5,3),columns=['col1','col2','col3'])

print(df1)
print('\n')

df1.index = [0,2,5,10,8]
df1

## Groupby

In [107]:
import pandas as pd

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
                     'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

print(df)
print('\n')
print (df.groupby('Team'))

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690


<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7fcb31cb5050>

In [108]:
x = df.groupby('Team')
print (x.mean())

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  762.250000
Royals  2.500000  2014.500000  752.500000
kings   4.000000  2015.000000  812.000000

In [ ]:
print (df.groupby('Team').median())
print (df.groupby('Team')[['Rank', 'Points']].median())

### View the groups

In [ ]:
df

In [109]:
print (df.groupby('Team').groups)

{'Devils': Int64Index([2, 3], dtype='int64'), 'Kings': Int64Index([4, 6, 7], dtype='int64'), 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'), 'Royals': Int64Index([9, 10], dtype='int64'), 'kings': Int64Index([5], dtype='int64')}

## Aggregations
An aggregated function returns a single aggregated value for each group.

In [110]:
new_df = df.groupby('Team').agg({'Rank' : 'sum', 'Points' : 'max'})
new_df

        Rank  Points
Team
Devils     5     863
Kings      5     788
Riders     7     876
Royals     5     804
kings      4     812

In [111]:
print(new_df.index)
print('\n')
print(new_df.columns)

Index(['Devils', 'Kings', 'Riders', 'Royals', 'kings'], dtype='object', name='Team')


Index(['Rank', 'Points'], dtype='object')

In [112]:
new_df = df.groupby('Team').agg({'Rank' : 'sum', 'Points' : 'max'}).reset_index()
new_df

     Team  Rank  Points
0  Devils     5     863
1   Kings     5     788
2  Riders     7     876
3  Royals     5     804
4   kings     4     812

In [113]:
print(new_df.index)
print('\n')
print(new_df.columns)

RangeIndex(start=0, stop=5, step=1)


Index(['Team', 'Rank', 'Points'], dtype='object')

In [114]:
new_df = df.groupby('Team').agg({'Rank' : ['sum', 'mean'], 'Points' : ['min', 'max']})
new_df

       Rank           Points
        sum      mean    min  max
Team
Devils    5  2.500000    673  863
Kings     5  1.666667    741  788
Riders    7  1.750000    690  876
Royals    5  2.500000    701  804
kings     4  4.000000    812  812

In [115]:
print(new_df.index)
print('\n')
print(new_df.columns)

Index(['Devils', 'Kings', 'Riders', 'Royals', 'kings'], dtype='object', name='Team')


MultiIndex([(  'Rank',  'sum'),
            (  'Rank', 'mean'),
            ('Points',  'min'),
            ('Points',  'max')],
           )

In [116]:
new_df[('Rank', 'sum')]

Team
Devils    5
Kings     5
Riders    7
Royals    5
kings     4
Name: (Rank, sum), dtype: int64

In [117]:
new_df = df.groupby('Team')['Rank'].agg(['min', 'max'])
new_df

        min  max
Team
Devils    2    3
Kings     1    3
Riders    1    2
Royals    1    4
kings     4    4

## Merging/Joining

In [118]:
df1 = pd.DataFrame({
         'id':[1,2,3,4,5],
         'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']})
df2 = pd.DataFrame(
         {'id':[1,2,3,4,5],
         'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print (df1)
print('\n')
print (df2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

### Merge Two DataFrames on a Key

In [119]:
pd.merge(df1,df2,on='id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [ ]:
df1 = pd.DataFrame({
         'id':[1,2,3,4,5],
         'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']})
df2 = pd.DataFrame(
         {'my_id':[1,2,3,4,5],
         'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print (df1)
print('\n')
print (df2)

In [120]:
pd.merge(df1,df2,left_on='id', right_on = 'my_id')

KeyError: 'my_id'

In [121]:
df1 = pd.DataFrame({
         'id':[1,2,3,4,5],
         'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']})
df2 = pd.DataFrame(
         {'id':[1,2,3,4,5],
         'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print (df1)
print('\n')
print (df2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [122]:
# looks for equal tuples
print(df1)
print('\n')
print(df2)

pd.merge(df1,df2,on=['id','subject_id'])

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

In [ ]:
?pd.merge

### Left join

In [123]:
print (df1)
print('\n')
print (df2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [ ]:
pd.merge(df1,df2, on='subject_id', how='left')

### Right join

In [124]:
pd.merge(df1,df2, on='subject_id', how='right')

   id_x  Name_x subject_id  id_y Name_y
0   2.0     Amy       sub2     1  Billy
1   3.0   Allen       sub4     2  Brian
2   4.0   Alice       sub6     4  Bryce
3   5.0  Ayoung       sub5     5  Betty
4   NaN     NaN       sub3     3   Bran

### Outer join

In [125]:
print (df1)
print('\n')
print (df2)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5


   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [126]:
#take all values of subject_id
pd.merge(df1,df2, how='outer', on='subject_id')

   id_x  Name_x subject_id  id_y Name_y
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   4.0  Bryce
4   5.0  Ayoung       sub5   5.0  Betty
5   NaN     NaN       sub3   3.0   Bran

### Inner join

In [127]:
#take common values of subject_id
pd.merge(df1, df2, on='subject_id', how='inner')

   id_x  Name_x subject_id  id_y Name_y
0     2     Amy       sub2     1  Billy
1     3   Allen       sub4     2  Brian
2     4   Alice       sub6     4  Bryce
3     5  Ayoung       sub5     5  Betty

In [128]:
pd.merge(df1,df2,on=['id','subject_id'], how = 'left')

   id  Name_x subject_id Name_y
0   1    Alex       sub1    NaN
1   2     Amy       sub2    NaN
2   3   Allen       sub4    NaN
3   4   Alice       sub6  Bryce
4   5  Ayoung       sub5  Betty

In [ ]:
?pd.merge

In [129]:
pd.merge(df2, df1, on='subject_id', how='inner')

   id_x Name_x subject_id  id_y  Name_y
0     1  Billy       sub2     2     Amy
1     2  Brian       sub4     3   Allen
2     4  Bryce       sub6     4   Alice
3     5  Betty       sub5     5  Ayoung